# ItemList

Let's first create an `ItemList` instance, which we use in the rest of this section.

In [1]:
from tohu.tohu_items_class import make_tohu_items_class
from tohu.item_list import ItemList

In [2]:
Quux = make_tohu_items_class("Quux", field_names=["aa", "bb", "cc", "dd"])

In [3]:
items = [
    Quux(aa=30, bb='672EF2', cc='Johnny', dd=False),
    Quux(aa=32, bb='250204', cc='David', dd=True),
    Quux(aa=55, bb='679DAE', cc='Angela', dd=False),
    Quux(aa=43, bb='91554C', cc='Pamela', dd=True),
    Quux(aa=56, bb='8EA713', cc='Blake', dd=True),
]

In [4]:
item_list = ItemList(items, Quux)
item_list

## Exporting to a pandas dataframe

When calling `.to_df()` without any arguments, all fields from all items will be exported.

In [5]:
item_list.to_df()

   aa      bb      cc     dd
0  30  672EF2  Johnny  False
1  32  250204   David   True
2  55  679DAE  Angela  False
3  43  91554C  Pamela   True
4  56  8EA713   Blake   True

We can export only a subset of columns (and/or rearrange them) by specifying a list of field names.

In [6]:
item_list.to_df(fields=["cc", "aa", "dd"])

       cc  aa     dd
0  Johnny  30  False
1   David  32   True
2  Angela  55  False
3  Pamela  43   True
4   Blake  56   True

If we want to rename the columns we can pass a dictionary of the form `{new_column_name: existing_field_name}`.

In [7]:
item_list.to_df(fields={"First Name": "cc", "Age": "aa"})

  First Name  Age
0     Johnny   30
1      David   32
2     Angela   55
3     Pamela   43
4      Blake   56